In [1]:
pip install pandas

Requirement already satisfied: pandas in /usr/local/lib/python3.6/dist-packages (1.1.5)
Requirement already satisfied: python-dateutil>=2.7.3 in /usr/local/lib/python3.6/dist-packages (from pandas) (2.8.1)
Requirement already satisfied: numpy>=1.15.4 in /usr/local/lib/python3.6/dist-packages (from pandas) (1.19.4)
Requirement already satisfied: pytz>=2017.2 in /usr/local/lib/python3.6/dist-packages (from pandas) (2018.9)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.6/dist-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

In [2]:
import pandas as pd

In [30]:
# DataFrame
df = pd.DataFrame({'X':[1,2,3,4,5],'Y':[6,7,8,9,10],'Z':[11,12,13,14,15]})
print(df)

   X   Y   Z
0  1   6  11
1  2   7  12
2  3   8  13
3  4   9  14
4  5  10  15

In [6]:
ser = pd.Series([1,2,3,4,5])
print(ser)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [12]:
# Random df
import numpy as np
pd.DataFrame(np.random.rand(2,5))

          0         1         2         3         4
0  0.677873  0.411589  0.374542  0.137861  0.582339
1  0.097348  0.921572  0.164551  0.397684  0.138660

In [28]:
date = pd.date_range('2021/1/1', periods=df.shape[0], freq = 'H') # Frequency - Division of dates
print(date)

DatetimeIndex(['2021-01-01 00:00:00', '2021-01-01 01:00:00',
               '2021-01-01 02:00:00', '2021-01-01 03:00:00',
               '2021-01-01 04:00:00'],
              dtype='datetime64[ns]', freq='H')

In [32]:
df.head() # 5 rows default
# df.tail(n) - n rows from bottom

   X   Y   Z
0  1   6  11
1  2   7  12
2  3   8  13
3  4   9  14
4  5  10  15

In [34]:
df.shape

(5, 3)

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   X       5 non-null      int64
 1   Y       5 non-null      int64
 2   Z       5 non-null      int64
dtypes: int64(3)
memory usage: 248.0 bytes

In [36]:
df.describe() # Statistical Summary - 5 point

              X          Y          Z
count  5.000000   5.000000   5.000000
mean   3.000000   8.000000  13.000000
std    1.581139   1.581139   1.581139
min    1.000000   6.000000  11.000000
25%    2.000000   7.000000  12.000000
50%    3.000000   8.000000  13.000000
75%    4.000000   9.000000  14.000000
max    5.000000  10.000000  15.000000

In [39]:
df['X']

0    1
1    2
2    3
3    4
4    5
Name: X, dtype: int64

In [43]:
df[['X','Z']]

   X   Z
0  1  11
1  2  12
2  3  13
3  4  14
4  5  15

In [45]:
df.iloc[1,:] # 1 row of all columns

X     2
Y     7
Z    12
Name: 1, dtype: int64

In [48]:
df.columns = ['a','b','c']
print(df)

   a   b   c
0  1   6  11
1  2   7  12
2  3   8  13
3  4   9  14
4  5  10  15

In [53]:
pd.isnull(df) # Find Null Values

       a      b      c
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False

In [54]:
df.dropna() # drop any na values

   a   b   c
0  1   6  11
1  2   7  12
2  3   8  13
3  4   9  14
4  5  10  15

In [55]:
df.fillna(123) # Fill all na with 123

   a   b   c
0  1   6  11
1  2   7  12
2  3   8  13
3  4   9  14
4  5  10  15

In [61]:
df.sort_values('a',ascending=False)

   a   b   c
4  5  10  15
3  4   9  14
2  3   8  13
1  2   7  12
0  1   6  11

In [66]:
csvTest = pd.read_csv('/content/sample_data/california_housing_test.csv')
csvTest.head()

   longitude  latitude  ...  median_income  median_house_value
0    -122.05     37.37  ...         6.6085            344700.0
1    -118.30     34.26  ...         3.5990            176500.0
2    -117.81     33.78  ...         5.7934            270500.0
3    -118.36     33.82  ...         6.1359            330000.0
4    -119.67     36.33  ...         2.9375             81700.0

[5 rows x 9 columns]

In [67]:
df.to_csv('myDataFrame.csv')